------------------------
-- Бренды, модели --
------------------------
INSERT INTO brand (
    brand_name
)
VALUES
    ('Марка');

INSERT INTO model (
    brand_id, model_name
)
VALUES
    (1, 'Модель');
----------------------------------------------
-- Электрохимические аккамуляторы --
----------------------------------------------
INSERT INTO battery_type (type_name)
VALUES 
    ('Свинцово-кислотные'), 
    ('Никелево-кадмиевые'),
    ('Литий-ионные'),
    ('Натрий-серные'),
    ('Проточные АКБ (на примере ванадий-редоксных)');

INSERT INTO energy_storage_characteristics (
    specific_energy, cycle_life, charge_time, 
    discharge_time, efficiency, self_discharge
) 
VALUES 
    (30, 600, '[5,8]', '[5,8]', 80, numrange(0.1, 0.3)),
    (50, 2000, '[5,8]', '[5,8]', 70, numrange(0.2, 0.6)),
    (150, 1500, '[3,5]', '[3,5]', 98, numrange(0.1, 0.3)),
    (200, 5000, NULL, NULL, 90, numrange(NULL, 20.0)),
    (35, 20000, NULL, NULL, 85, numrange(0, 1));

INSERT INTO electrochemical_battery_history (
    type_id, characteristics_id, temperature_range,
    input_voltage, output_voltage, internal_resistance,
    operating_temperature, model_id
)
VALUES
    -- Свинцово-кислотные
    (1, 1, '[0,10]', 3.7, 3.7, 0.005, NULL, 1),
    (1, 1, '[0,20]', 3.5, 3.4, 0.007, NULL, 1),
    (1, 1, '[-20,20]', 3.5, 3.4, 0.004, NULL, 1),
    (1, 1, '[-4,25]', 3.5, 3.4, 0.007, NULL, 1),
    (1, 1, '[7,40]', 4, 3.2, 0.005, NULL, 1),
    (1, 1, '[0,21]', 3.6, 3.6, 0.007, NULL, 1),
    (1, 1, '[0,23]', 3.9, 3.1, 0.01, NULL, 1),
    (1, 1, '[20,23]', 4.0, 3.0, 1, NULL, 1),
    -- Никелево-кадмиевые
    (2, 2, '[20,23]', 3.7, 3.7, 0.005, NULL, NULL),
    (2, 2, '[20,20]', 3.5, 3.4, 0.007, NULL, NULL),
    (2, 2, '[23,25]', 3.5, 3.4, 0.05, NULL, NULL),
    (2, 2, '[27,30]', 3.5, 3.4, 0.002, NULL, NULL),
    (2, 2, '[30,40]', 4, 3.2, 0.003, NULL, NULL),
    (2, 2, '[20,21]', 3.6, 3.6, 0.006, NULL, NULL),
    (2, 2, '[20,23]', 3.9, 3.1, 0.01, NULL, NULL),
    (2, 2, '[20,23]', 4.0, 3.0, 1, NULL, NULL),
    -- Литий-ионные
    (3, 3, '[35,40]', 3.7, 3.7, 0.005, 40, NULL),
    (3, 3, '[40,60]', 3.5, 3.4, 0.1, 40, NULL),
    (3, 3, '[43,59]', 3.5, 3.4, 0.05, 40, NULL),
    (3, 3, '[44,50]', 3.5, 3.4, 0.002, 40, NULL),
    (3, 3, '[30,40]', 4, 3.2, 0.003, 40, NULL),
    (3, 3, '[20,21]', 3.6, 3.6, 0.006, 40, NULL),
    (3, 3, '[35,43]', 3.9, 3.1, 0.01, 40, NULL),
    (3, 3, '[35,43]', 4.0, 3.0, 1, 40, NULL),
    -- Натрий-серные
    (4, 4, '[350,350]', 3.7, 3.7, 0.005, 50, NULL),
    (4, 4, '[320,325]', 3.5, 3.4, 0.1, 50, NULL),
    (4, 4, '[300,300]', 3.5, 3.4, 0.05, 50, NULL),
    (4, 4, '[349,350]', 3.5, 3.4, 0.002, 50, NULL),
    (4, 4, '[340,350]', 4, 3.2, 0.003, 50, NULL),
    (4, 4, '[321,324]', 3.6, 3.6, 0.006, 50, NULL),
    (4, 4, '[325,330]', 3.9, 3.1, 0.01, 50, NULL),
    (4, 4, '[338,350]', 4.0, 3.0, 1, 50, NULL),
    -- Проточные АКБ (на примере ванадий-редоксных)
    (5, 5, '[35,40]', 3.7, 3.7, 0.005, 30, NULL),
    (5, 5, '[40,60]', 3.5, 3.4, 0.1, 30, NULL),
    (5, 5, '[43,59]', 3.5, 3.4, 0.05, 30, NULL),
    (5, 5, '[44,50]', 3.5, 3.4, 0.002, 30, NULL),
    (5, 5, '[30,40]', 4, 3.2, 0.003, 30, NULL),
    (5, 5, '[20,21]', 3.6, 3.6, 0.006, 30, NULL),
    (5, 5, '[35,43]', 3.9, 3.1, 0.01, 30, NULL),
    (5, 5, '[35,43]', 4.0, 3.0, 1, 30, NULL);
-----------------------------------
-- Термические накопители --
-----------------------------------
INSERT INTO energy_storage_characteristics (
    specific_energy, cycle_life, 
    temperature_range, self_discharge
) 
VALUES 
    (70, 10, '[-20,50]', numrange(0, 1));

INSERT INTO thermal_storage_history (
    characteristics_id, thermal_power, efficiency
)
VALUES
    (6, 51.0, 81.0),
    (6, 52.0, 17.5),
    (6, 55.0, 16.3),
    (6, 52.3, 90.6),
    (6, 54.7, 50.1),
    (6, 54.3, 47.0),
    (6, 55.1, 80.0),
    (6, 55.0, 86.0),
    (6, 49.7, 84.5),
    (6, 71.0, 87.3),
    (6, 73.0, 82.2),
    (6, 74.3, 75.0),
    (6, 72.1, 74.3),
    (6, 150.0, 70.2);
----------------------------------
-- Водородные накопители --
----------------------------------
INSERT INTO energy_storage_characteristics (
    specific_energy, efficiency
) 
VALUES 
    (900, 50);

INSERT INTO hydrogen_storage_history (
    characteristics_id, brand_id, model_id,
    temperature_range, nominal_voltage
)
VALUES
    (7, 1, 1, '[1010,1700]', 2.6),
    (7, 1, 1, '[1500,1610]', 2.3),
    (7, 1, 1, '[1300,1321]', 2.4),
    (7, 1, 1, '[1550,1630]', 2.5),
    (7, 1, 1, '[1240,1540]', 2.8),
    (7, 1, 1, '[1230,1350]', 3.1),
    (7, 1, 1, '[1100,1460]', 2.3),
    (7, 1, 1, '[1200,1610]', 2.4);
--------------------------------
-- Cолнечные накопители --
--------------------------------
INSERT INTO solar_panel (
    brand_id, model_id, length,
    width, weight, panel_count, 
    battery_count, voltage
)
VALUES 
    (1, 1, 1.2, 0.6, 18.5, 10, 5, 37.0),
    (1, 1, 1.3, 0.7, 20.0, 12, 7, 35.0);

INSERT INTO solar_panel_power_history (
    panel_id, nominal_power
)
VALUES 
    (1, 254.1),
    (1, 265.5),
    (1, 252.3),
    (1, 244.7),
    (1, 256.4),
    (1, 267.3),
    (1, 283.6),
    (1, 216.8),
    (1, 227.4),
    (1, 234.3),
    (1, 243.2),
    (1, 252.4),
    (1, 234.5),
    (1, 245.7);

INSERT INTO inverter_type (
    type_name, description
)
VALUES
    ('Центральный инвертор', 'Несколько ФС модулей соединены в ряд и образуют цепочку, несколько таких цепочек параллельно подключаются к центральному инвертору.'),
    ('Автономный (отдельный) инвертор', 'Каждая цепь ФС модулей подключается к отдельному инвертору. Постоянный ток, генерируемый каждой цепью, преобразуется в переменный соответствующим инвертором, затем объединенная мощность подается в сеть'),
    ('Инвертор большой мощности с параллельными цепями', 'Конфигурация аналогична автономному инвертору, но с возможностью соединять несколько цепей постоянного тока к одному инвертору, что обеспечивает большую гибкость при проектировании. Обычно используется для больших ФС.'),
    ('Инвертор с модулем переменного тока', 'В этой конфигурации инвертор напрямую интегрирован в ФС, каждый из модулей работает независимо, генерируя переменный ток, который подается в сеть или накапливается. Такой тип инверторов обычно используется в небольших системах, где состояние каждого из модулей легко отследить и заменить его в случае неисправности, недостаток – необходима система синхронизации модулей');

INSERT INTO inverter (
    type_id, specific_energy
)
VALUES
    (1, '[500,1000]'),
    (1, '[1000,5000]'),
    (1, '[5000,20000]'),
    (2, '[1,10]'),
    (2, '[10,500]'),
    (3, '[3,10]'),
    (4, '[50,500]');
----------------------------------------------
-- Ветроаккумулирующие накопители --
----------------------------------------------
INSERT INTO wind_turbine_history (
    brand_id, model_id, power, voltage
)
VALUES
    (1, 1, 114.4, 236.6),
    (1, 1, 122.6, 244.4),
    (1, 1, 137.8, 258.6),
    (1, 1, 148.9, 267.7),
    (1, 1, 154.5, 276.9),
    (1, 1, 163.4, 284.8),
    (1, 1, 176.3, 293.3);
    